#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-xgTt92urQVbE5Esi

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210630175300092700000001]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_resource.app: Refreshing state... [id=l8dcc6]
aws_api_gateway_resource.actions: Refreshing state... [id=i57f4h]
aws_api_gateway_resource.proxy: Refreshing state... [id=oly2td]
aws_api_gateway_method.actions: Refreshing state... [id=agm-gcp9dahm4c-i57f4h-ANY]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-gcp9dahm4c-oly2td-ANY]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-gcp9dahm4c-i57f4h-ANY]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-gcp9dahm4c-oly2td-ANY]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_deployment.this: Refreshing state... [id=r8ef9v]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - logs    = []
                  - success = true
                }
              - headers    = {
                  - time = "2021-07-30T23:35:17.804Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
        id                             = "lambda-actions"
      - image_uri                      = "" -> null
      - kms_key_arn                    = "" -> null
      ~ last_modified                  = "2021-07-30T23:35:17.063+0000" -> (known after apply)
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      ~ source_code_hash               = "AZbSjnGnE0qS3bX3OOU5G19Nv2PCRwawsCTI9ooImFQ=" -> "Hp5yvaAdz5avXoonrBmvCgfFgd9yK9Y5EOiwPoGSkaI="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DB_HOSTNAME" = "aurora-db-postgres.cluster-ch8pcggluehm.ca-central-1.rds.amazonaws.com"
              - "DB_NAME"     = "ExampleDB2"
              - "DB_PASSWORD" = (sensitive)
              - "DB_USERNAME" = (sensitive)
              - "GH_SECRET"   = "secret"
              - "NODE_ENV"    = "production"
            } -> (known after apply)
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
        id                             = "lambda-app"
      - image_uri                      = "" -> null
      - kms_key_arn                    = "" -> null
      ~ last_modified                  = "2021-07-30T23:35:02.708+0000" -> (known after apply)
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      ~ source_code_hash               = "+Y2ZxUNMj9FRbTY68L0GNk45+vyVAY8eDdIUGimQRTE=" -> "FkkQZE/sKGZN8dzfqTZMorS7TbtVuGAFgfhwiB0SvNE="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "AUD"                         = "sso-requests"
              - "CONFIGURATION_ENDPOINT"      = "https://dev.oidc.gov.bc.ca/auth/realms/onestopauth/.well-known/openid-configuration"
              - "DB_HOSTNAME"                 = "aurora-db-postgres.cluster-ch8pcggluehm.ca-central-1.rds.amazonaws.com"
              - "DB_NAME"                     = "ExampleDB2"
              - "DB_PASSWORD"                 = (sensitive)
              - "DB_USERNAME"                 = (sensitive)
              - "GH_ACCESS_TOKEN"             = "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"
              - "GH_BRANCH"                   = "main"
              - "GH_OWNER"                    = "bcgov"
              - "GH_REPO"                     = "sso-terraform-dev"
              - "GH_WORKFLOW_ID"              = "request.yml"
              - "KEYCLOAK_DEV_CLIENT_ID"      = "terraform-cli"
              - "KEYCLOAK_DEV_CLIENT_SECRET"  = "d39a06f5-88b6-4020-8681-b301e1668f37"
              - "KEYCLOAK_DEV_URL"            = "https://sso-dev-3d5c3f-dev.apps.silver.devops.gov.bc.ca"
              - "KEYCLOAK_PROD_CLIENT_ID"     = "terraform-cli"
              - "KEYCLOAK_PROD_CLIENT_SECRET" = "371366bd-b6b8-485d-a4fa-b89cb8942e63"
              - "KEYCLOAK_PROD_URL"           = "https://sso-prod-3d5c3f-prod.apps.silver.devops.gov.bc.ca"
              - "KEYCLOAK_TEST_CLIENT_ID"     = "terraform-cli"
              - "KEYCLOAK_TEST_CLIENT_SECRET" = "f14b5523-9cbe-4720-b030-6d54d01632aa"
              - "KEYCLOAK_TEST_URL"           = "https://sso-test-3d5c3f-test.apps.silver.devops.gov.bc.ca"
              - "LOCAL_DEV"                   = "false"
              - "NODE_ENV"                    = "production"
            } -> (known after apply)
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
        id                             = "lambda-db"
      - image_uri                      = "" -> null
      - kms_key_arn                    = "" -> null
      ~ last_modified                  = "2021-07-30T23:35:09.845+0000" -> (known after apply)
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      ~ source_code_hash               = "DP4t2DHIwYoXpou6caX8XcnmAUXgNHKWqiSoNWWiuAI=" -> "Pt4rl5t32Huu2zY+rOmaYFs6ZR8aSpJX5NjE6w1PBBs="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DB_HOSTNAME" = "aurora-db-postgres.cluster-ch8pcggluehm.ca-central-1.rds.amazonaws.com"
              - "DB_NAME"     = "ExampleDB2"
              - "DB_PASSWORD" = (sensitive)
              - "DB_USERNAME" = (sensitive)
              - "NODE_ENV"    = "production"
            } -> (known after apply)
        }


        # (2 unchanged blocks hidden)
    }

  # random_password.db_password will be created
  + resource "random_password" "db_password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.db.aws_db_subnet_group.this[0] will be updated in-place
  ~ resource "aws_db_subnet_group" "this" {
        id          = "aurora-db-postgres"
        name        = "aurora-db-postgres"
      ~ tags        = {
          - "Terraform"  = "true" -> null
          + "managed-by" = "terraform"
            # (1 unchanged element hidden)
        }
      ~ tags_all    = {
          - "Terraform"  = "true" -> null
          + "managed-by" = "terraform"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.db.aws_rds_cluster.this[0] must be replaced
-/+ resource "aws_rds_cluster" "this" {
      ~ arn                                 = "arn:aws:rds:ca-central-1:220881534007:cluster:aurora-db-postgres" -> (known after apply)
      ~ availability_zones                  = [
          - "ca-central-1a",
          - "ca-central-1b",
          - "ca-central-1d",
        ] -> (known after apply)
      + cluster_identifier_prefix           = (known after apply)
      ~ cluster_members                     = [] -> (known after apply)
      ~ cluster_resource_id                 = "cluster-3UN7ZBDZY6RIVBIUIPS5DOUSGI" -> (known after apply)
      ~ database_name                       = "ExampleDB2" -> "ssorequests1" # forces replacement
      ~ db_cluster_parameter_group_name     = "default.aurora-postgresql10" -> (known after apply)
      - enabled_cloudwatch_logs_exports     = [] -> null
      ~ endpoint                            = "aurora-db-postgres.cluster-ch8pcggluehm.ca-central-1.rds.amazonaws.com" -> (known after apply)
      ~ engine_version                      = "10.14" -> (known after apply)
      ~ hosted_zone_id                      = "Z1JG78A3UK1DU3" -> (known after apply)
      - iam_roles                           = [] -> null
      ~ id                                  = "aurora-db-postgres" -> (known after apply)
      ~ kms_key_id                          = "arn:aws:kms:ca-central-1:220881534007:key/e21a3726-7c61-43d0-b7ee-aa0c37f4b943" -> (known after apply)
      ~ master_password                     = (sensitive value)
      ~ master_username                     = (sensitive) # forces replacement
      ~ reader_endpoint                     = "" -> (known after apply)
      ~ tags                                = {
          - "Terraform"  = "true" -> null
          + "managed-by" = "terraform"
        }
      ~ tags_all                            = {
          - "Terraform"  = "true" -> null
          + "managed-by" = "terraform"
        }
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.db.aws_security_group.this[0] will be updated in-place
  ~ resource "aws_security_group" "this" {
        id                     = "sg-064f9794b304dc7dd"
        name                   = "aurora-db-postgres-20210630183109998100000001"
      ~ tags                   = {
          - "Terraform"  = "true" -> null
          + "managed-by" = "terraform"
            # (1 unchanged element hidden)
        }
      ~ tags_all               = {
          - "Terraform"  = "true" -> null
          + "managed-by" = "terraform"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 5 to change, 1 to destroy.

Changes to Outputs:
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2021-07-30T23:35:17.804Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 1 of 2 estimated
           $89.28/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*